CSI API ETABS v1
cCaseStaticNonlinear.GetTargetForceParameters Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetTargetForceParameters(
	string Name,
	ref double TolConvF,
	ref int MaxIter,
	ref double AccelFact,
	ref bool NoStop
)
Function GetTargetForceParameters (
	Name As String,
	ByRef TolConvF As Double,
	ByRef MaxIter As Integer,
	ByRef AccelFact As Double,
	ByRef NoStop As Boolean
) As Integer
Dim instance As cCaseStaticNonlinear
Dim Name As String
Dim TolConvF As Double
Dim MaxIter As Integer
Dim AccelFact As Double
Dim NoStop As Boolean
Dim returnValue As Integer
returnValue = instance.GetTargetForceParameters(Name,
	TolConvF, MaxIter, AccelFact, NoStop)
int GetTargetForceParameters(
	String^ Name,
	double% TolConvF,
	int% MaxIter,
	double% AccelFact,
	bool% NoStop
)
abstract GetTargetForceParameters :
        Name : string *
        TolConvF : float byref *
        MaxIter : int byref *
        AccelFact : float byref *
        NoStop : bool byref -> int
Parameters
Name
Type: System.String
TolConvF
Type: System.Double
MaxIter
Type: System.Int32
AccelFact
Type: System.Double
NoStop
Type: System.Boolean
Return Value
Type: Int32
See Also
Reference
cCaseStaticNonlinear Interface
ETABSv1 Namespace